Repository: openintents/translations-import
Catalog: translations_flashlight/*.po
Languages: sv

source: translator-credits
sv: Launchpad Contributions: Carl Fredrik Sima https://launchpad.net/~cf-sima

source: Keep the camera flash or the backlight turned on with OI Flashlight.
sv: Håll kamerablixten eller bakgrundsbelysningen påslagen med hjälp av OI Flashlight.

source: The backlight stays turned on.
sv: Bakgrundsbelysningen fortsätter vara påslagen.

source: Color
sv: Färg

source: Preferences
sv: Inställningar

source: Keep color
sv: Behåll färgen

source: Save color for next time Flashlight app is started
sv: Behåll färgen tills nästa gång OI Flashlight startas

source: To make the Color Picker more useful to other developers, we have split it into its own app.
sv: För att göra Color Picker mer användbart för andra utvecklare så har vi gjort funktionen till en egen applikation.

source: Use camera flash
sv: Använd kamerablixten

source: Use the camera flash instead of the screen backlight.
sv: Använd kamerablixten istället för bakgrundsbelysningen.

source: Press to enable camera light (May take a second).
sv: Tryck för att använda kamerablixten (Kan ta någon sekund tills den är igång)

source: Press to disable camera light.
sv: Tryck för att slå av kamerablixten.
