Repository: openintents/translations-import
Catalog: translations_updatechecker/*.po
Languages: fi

source: translator-credits
fi: Launchpad Contributions: emp https://launchpad.net/~emp500

source: OI Update
fi: OI Päivittäjä

source: A new version of %s is available.\nWould you like to upgrade?
fi: Uusi versio %s :sta on saatavilla.\nHaluatko päivittää?

source: A new version of %1$s is available at %2$s.\n%3$s\n
fi: Uusi versio %1$s on saatavilla %2$s.\n%3$s\n

source: A new version of %1$s is available.\n%2$s\n
fi: Uusi versio %1$s :sta on saatavilla.\n%2$s\n

source: A new version of %1$s is available at %2$s.
fi: Uusi versio %1$s :sta on saatavilla %2$s :sta.

source: A new version of %s is available.
fi: Uusi versio %s :sta on saatavilla.

source: Android Market not available.
fi: Android Market ei ole saatavilla.

source: Version %1$s\nSD card %2$s\n\nOS\n%3$s
fi: Versio %1$s\nSD-kortti %2$s\n\nOSn%3$s

source: free space: %s
fi: vapaata tilaa: %s

source: Board %1$s\nBrand %2$s\nDevice %3$s\nID %4$s\nModel %5$s
fi: Lauta %1$s\nMerkki %2$s\nLaite %3$s\nID %4$s\nMalli %5$s

source: Perform update now!
fi: Suorita päivitys nyt!

source: Try update from Market now!
fi: Yritä päivittää Marketista nyt!

source: Try update from AndAppStore now!
fi: Yritä päivittää AndAppStore:sta nyt!

source: Remind me later!
fi: Muistuta minua myöhemmin!

source: Ignore this update
fi: Hylkää tämä päivitys

source: Ignore all further updates
fi: Hylkää kaikki tulevat päivitykset

source: Update could not be started!\n\nPlease contact application developer!\n\n%s
fi: Päivitystä ei voinut aloittaa!\n\nOle hyvä, ja ota yhteyttä ohjelman kehittäjään!\n\n%s

source: Application is up-to-date.
fi: Ohjelma on ajan tasalla.

source: Checking for new version.
fi: Tarkistetaan uuden version varalta.

source: Building list of applications.
fi: Rakennetaan ohjelmalistaa.

source: Check AndAppStore.com
fi: Katso AndAppStore.com:ia

source: Check versions
fi: Tarkista versiot

source: Show all
fi: Näytä kaikki

source: Refresh
fi: Päivitä

source: Checked AndAppStore
fi: AndAppStore tarkistettu

source: Current version: %s
fi: Tämänhetkinen versio: %s

source: Current version code: %s
fi: Tämänhetkinen versiokoodi: %s

source: Newer version: %s
fi: Uudempi versio: %s

source: Newer version: %1$s - %2$s
fi: Uudempi versio: %1$s - %2$s

source: Newer version available.
fi: Uudempi versio on saatavilla.

source: No update information found.
fi: Ei päivitystietoja saatavilla.

source: OI Update - List of new versions
fi: OI Päivittäjä - Lista uusista versioista

source: OI Update - New versions at AndAppStore
fi: OI Päivittäjä - Uudet versiot AndAppStore:sta

source: OI Update - List of managed applications
fi: OI Päivittäjä - Lista hallinnoiduista ohjelmista

source: OI Update - List of managed applications (check at AndAppStore)
fi: OI Päivittäjä - Lista hallinnoiduista ohjelmista (katso AndAppStore:sta)

source: Settings
fi: Asetukset

source: Auto check
fi: Automaattinen tarkistus

source: Ignored
fi: Hylätty

source: Updates are currently ignored. Would you like to receive updates again?
fi: Päivitykset ovat tällä hetkellä huomiotta jätetty. Haluatko saada päivityksiä uudestaan?

source: Unknown
fi: Tuntematon

source: No update information available. Please check manually and ask the developer to support OI Update in the future.
fi: Ei päivitystietoja saatavilla. Ole hyvä, ja tarkista automaattisesti ja kysy kehittäjältä voisiko hän tukea OI Päivittäjää tulevaisuudessa.

source: Search on Market
fi: Hae Marketista

source: Search on AndAppStore
fi: Hae AndAppStore:sta

source: Processing %s
fi: Käsitellään %s

source: The update process of this application directs to a different site than Android Market. Applications installed from unknown sources might exhibit a security risk.
fi: Tämän ohjelman päivitysprosessi ohjaa toiselle sivulle kuin Android Market. Ohjelmat, jotka ovat asennettu tuntemattomista lähteistä voivat muodostaa turvallisuusriskin.

source: Continue anyway
fi: Jatka silti

source: Abort
fi: Lopeta

source: Auto update
fi: Automaattinen päivitys

source: If checked, search for updates is performed regularly
fi: Jos tarkistettu, päivitysten haku suoritetaan säännöllisesti

source: Update interval
fi: Päivitystiheys

source: Set the interval how often the update search should be performed.
fi: Määritä tiheys, kuinka usein päivityshaku tulisi tehdä.

source: Select interval
fi: Valitse tiheys

source: every_month
fi: joka_kuukausi

source: Warning
fi: Varoitus

source: If you uncheck this item, you will no longer receive notifications for updates. Do you still want to uncheck auto update?
fi: Jos poistat tämän kohteen valinnan, et enää vastaanota ilmoituksia päivityksistä. Oletko aivan varma, että haluat poistaa valinnan automaattisesta päivityksestä?

source: Use AndAppStore
fi: Käytä AndAppStore:a

source: Use version information provided by AndAppStore.com
fi: Käytä versiotietoa, jonka AndAppStore.com on toimittanut

source: Read update information
fi: Lue päivitystiedot

source: Write update information
fi: Kirjoita päivitystiedot

source: Read information about installed applications, update locations and requests.
fi: Lue tietoja asennetuista päivityksistä, päivityspaikoista ja pyynnöistä.

source: Write information about installed applications, update locations and requests.
fi: Kirjoita tietoja asennetuista päivityksistä, päivityspaikoista ja pyynnöistä.

source: About
fi: Tietoja

source: About %s
fi: Tietoja %s

source: Version %s \n\n OI Update keeps you informed on new application versions.\n OpenIntents allows different Android applications to share data using intents and open interfaces.\n\n For more information and other great applications visit OpenIntents at www.openintents.org
fi: Versio %s \n\n OI Päivittäjä pitää sinut ajan tasalla uusista ohjelmistoversioista.\n OpenIntents mahdollistaa erilaisten Android ohjelmistojen jakaa tietoja käyttäen katsomuksia (intents) ja vapaita (open) käyttäjäliittymiä.\n\n Lisätietoja ja muita mahtavia ohjelmistoja saat OpenIntents:ltä (www.openintents.org)

source: OI Update EULA
fi: OI Päivittäjä EULA

source: Accept
fi: Hyväksy

source: Cancel
fi: Peruuta
